app/controllers/games_controller.rb

INSERT INTO "games" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 01 Jul 2014 22:43:56 UTC +00:00], ["updated_at", Tue, 01 Jul 2014 22:43:56 UTC +00:00], ["user_id", 20]]
INSERT INTO "rounds" ("content", "content_type", "created_at", "game_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    if user_logged_in?
      game = Game.create(user_id: current_user)
      Round.create( game_id: game.id,
                    user_id: current_user,
                    content: params['round']['content'],
                    content_type: params['round']['content_type'])