app/controllers/users_controller.rb

  def create
    new_user = User.new(user_params)
    if new_user.save
---
INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"

  def login
    if user = User.find_by(username: user_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'kevon' LIMIT 1

  def games
    if user_logged_in?
      @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 361]]